FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_pwr.c
/**
 ******************************************************************************
 * @file    stm32l1xx_pwr.c
 * @author  MCD Application Team
 * @version V1.1.1
 * @date    05-March-2012
 * @brief   This file provides firmware functions to manage the following
 *          functionalities of the Power Controller (PWR) peripheral:
 *           + RTC Domain Access
 *           + PVD configuration
 *           + WakeUp pins configuration
 *           + Ultra Low Power mode configuration
 *           + Voltage Scaling configuration
 *           + Low Power modes configuration
 *           + Flags management
 *
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
 *
 * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
 * You may not use this file except in compliance with the License.
 * You may obtain a copy of the License at:
 *
 *        http://www.st.com/software_license_agreement_liberty_v2
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "stm32l1xx_pwr.h"
#include "stm32l1xx_rcc.h"

/** @addtogroup STM32L1xx_StdPeriph_Driver
 * @{
 */

/** @defgroup PWR
 * @brief PWR driver modules
 * @{
 */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* --------- PWR registers bit address in the alias region ---------- */
#define PWR_OFFSET    ( PWR_BASE - PERIPH_BASE )

/* --- CR Register ---*/

/* Alias word address of DBP bit */
#define CR_OFFSET         ( PWR_OFFSET + 0x00 )
#define DBP_BitNumber     0x08
#define CR_DBP_BB         ( PERIPH_BB_BASE + ( CR_OFFSET * 32 ) + ( DBP_BitNumber * 4 ) )

/* Alias word address of PVDE bit */
#define PVDE_BitNumber    0x04
#define CR_PVDE_BB        ( PERIPH_BB_BASE + ( CR_OFFSET * 32 ) + ( PVDE_BitNumber * 4 ) )

/* Alias word address of ULP bit */
#define ULP_BitNumber     0x09
#define CR_ULP_BB         ( PERIPH_BB_BASE + ( CR_OFFSET * 32 ) + ( ULP_BitNumber * 4 ) )

/* Alias word address of FWU bit */
#define FWU_BitNumber     0x0A
#define CR_FWU_BB         ( PERIPH_BB_BASE + ( CR_OFFSET * 32 ) + ( FWU_BitNumber * 4 ) )

/* --- CSR Register ---*/

/* Alias word address of EWUP bit */
#define CSR_OFFSET        ( PWR_OFFSET + 0x04 )
#define EWUP_BitNumber    0x08
#define CSR_EWUP_BB       ( PERIPH_BB_BASE + ( CSR_OFFSET * 32 ) + ( EWUP_BitNumber * 4 ) )

/* ------------------ PWR registers bit mask ------------------------ */

/* CR register bit mask */
#define CR_DS_MASK     ( ( uint32_t ) 0xFFFFFFFC )
#define CR_PLS_MASK    ( ( uint32_t ) 0xFFFFFF1F )
#define CR_VOS_MASK    ( ( uint32_t ) 0xFFFFE7FF )

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/** @defgroup PWR_Private_Functions
 * @{
 */

/** @defgroup PWR_Group1 RTC Domain Access function
 *  @brief   RTC Domain Access function
 *
 * @verbatim
 * ==============================================================================
 ##### RTC Domain Access function #####
 #####==============================================================================
 #####
 #####[..] After reset, the RTC Registers (RCC CSR Register, RTC registers and RTC backup
 #####   registers) are protected against possible stray write accesses.
 #####[..] To enable access to RTC domain use the PWR_RTCAccessCmd(ENABLE) function.
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Deinitializes the PWR peripheral registers to their default reset values.
 * @note   Before calling this function, the VOS[1:0] bits should be configured
 *         to "10" and the system frequency has to be configured accordingly.
 *         To configure the VOS[1:0] bits, use the PWR_VoltageScalingConfig()
 *         function.
 * @note   ULP and FWU bits are not reset by this function.
 * @param  None
 * @retval None
 */
void PWR_DeInit( void )
{
    RCC_APB1PeriphResetCmd( RCC_APB1Periph_PWR, ENABLE );
    RCC_APB1PeriphResetCmd( RCC_APB1Periph_PWR, DISABLE );
}

/**
 * @brief  Enables or disables access to the RTC and backup registers.
 * @note   If the HSE divided by 2, 4, 8 or 16 is used as the RTC clock, the
 *         RTC Domain Access should be kept enabled.
 * @param  NewState: new state of the access to the RTC and backup registers.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void PWR_RTCAccessCmd( FunctionalState NewState )
{
    /* Check the parameters */
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    *( __IO uint32_t * ) CR_DBP_BB = ( uint32_t ) NewState;
}

/**
 * @}
 */

/** @defgroup PWR_Group2 PVD configuration functions
 *  @brief   PVD configuration functions
 *
 * @verbatim
 * ==============================================================================
 ##### PVD configuration functions #####
 #####==============================================================================
 #####[..]
 #####(+) The PVD is used to monitor the VDD power supply by comparing it to a threshold
 #####selected by the PVD Level (PLS[2:0] bits in the PWR_CR).
 #####(+) The PVD can use an external input analog voltage (PVD_IN) which is compared
 #####internally to VREFINT. The PVD_IN (PB7) has to be configured in Analog mode
 #####when PWR_PVDLevel_7 is selected (PLS[2:0] = 111).
 #####(+) A PVDO flag is available to indicate if VDD/VDDA is higher or lower than the
 #####PVD threshold. This event is internally connected to the EXTI line16
 #####and can generate an interrupt if enabled through the EXTI registers.
 #####(+) The PVD is stopped in Standby mode.
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Configures the voltage threshold detected by the Power Voltage Detector(PVD).
 * @param  PWR_PVDLevel: specifies the PVD detection level.
 *   This parameter can be one of the following values:
 *     @arg PWR_PVDLevel_0: PVD detection level set to 1.9V.
 *     @arg PWR_PVDLevel_1: PVD detection level set to 2.1V.
 *     @arg PWR_PVDLevel_2: PVD detection level set to 2.3V.
 *     @arg PWR_PVDLevel_3: PVD detection level set to 2.5V.
 *     @arg PWR_PVDLevel_4: PVD detection level set to 2.7V.
 *     @arg PWR_PVDLevel_5: PVD detection level set to 2.9V.
 *     @arg PWR_PVDLevel_6: PVD detection level set to 3.1V.
 *     @arg PWR_PVDLevel_7: External input analog voltage (Compare internally to VREFINT).
 * @retval None
 */
void PWR_PVDLevelConfig( uint32_t PWR_PVDLevel )
{
    uint32_t tmpreg = 0;

    /* Check the parameters */
    assert_param( IS_PWR_PVD_LEVEL( PWR_PVDLevel ) );

    tmpreg = PWR->CR;

