FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_pwr.c
    /* Clear PLS[7:5] bits */
    tmpreg &= CR_PLS_MASK;

    /* Set PLS[7:5] bits according to PWR_PVDLevel value */
    tmpreg |= PWR_PVDLevel;

    /* Store the new value */
    PWR->CR = tmpreg;
}

/**
 * @brief  Enables or disables the Power Voltage Detector(PVD).
 * @param  NewState: new state of the PVD.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void PWR_PVDCmd( FunctionalState NewState )
{
    /* Check the parameters */
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    *( __IO uint32_t * ) CR_PVDE_BB = ( uint32_t ) NewState;
}

/**
 * @}
 */

/** @defgroup PWR_Group3 WakeUp pins configuration functions
 *  @brief   WakeUp pins configuration functions
 *
 * @verbatim
 * ==============================================================================
 ##### WakeUp pin configuration functions #####
 #####==============================================================================
 #####
 #####(+) WakeUp pins are used to wakeup the system from Standby mode. These pins are
 #####forced in input pull down configuration and are active on rising edges.
 #####(+) There are three WakeUp pins: WakeUp Pin 1 on PA.00, WakeUp Pin 2 on PC.13 and
 #####WakeUp Pin 3 on PE.06.
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Enables or disables the WakeUp Pin functionality.
 * @param  PWR_WakeUpPin: specifies the WakeUpPin.
 *   This parameter can be: PWR_WakeUpPin_1, PWR_WakeUpPin_2 or PWR_WakeUpPin_3.
 * @param  NewState: new state of the WakeUp Pin functionality.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void PWR_WakeUpPinCmd( uint32_t PWR_WakeUpPin,
                       FunctionalState NewState )
{
    __IO uint32_t tmp = 0;

    /* Check the parameters */
    assert_param( IS_PWR_WAKEUP_PIN( PWR_WakeUpPin ) );

    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    tmp = CSR_EWUP_BB + PWR_WakeUpPin;

    *( __IO uint32_t * ) ( tmp ) = ( uint32_t ) NewState;
}

/**
 * @}
 */

/** @defgroup PWR_Group4 Ultra Low Power mode configuration functions
 *  @brief   Ultra Low Power mode configuration functions
 *
 * @verbatim
 * ==============================================================================
 ##### Ultra Low Power mode configuration functions #####
 #####==============================================================================
 #####[..]
 #####(+) The internal voltage reference consumption is not negligible, in particular
 #####in Stop and Standby mode. To reduce power consumption, use the PWR_UltraLowPowerCmd()
 #####function (ULP bit (Ultra low power) in the PWR_CR register) to disable the
 #####internal voltage reference. However, in this case, when exiting from the
 #####Stop/Standby mode, the functions managed through the internal voltage reference
 #####are not reliable during the internal voltage reference startup time (up to 3 ms).
 #####To reduce the wakeup time, the device can exit from Stop/Standby mode without
 #####waiting for the internal voltage reference startup time. This is performed
 #####by using the PWR_FastWakeUpCmd() function (setting the FWU bit (Fast
 #####wakeup) in the PWR_CR register) before entering Stop/Standby mode.
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Enables or disables the Fast WakeUp from Ultra Low Power mode.
 * @param  NewState: new state of the Fast WakeUp  functionality.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void PWR_FastWakeUpCmd( FunctionalState NewState )
{
    /* Check the parameters */
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    *( __IO uint32_t * ) CR_FWU_BB = ( uint32_t ) NewState;
}

/**
 * @brief  Enables or disables the Ultra Low Power mode.
 * @param  NewState: new state of the Ultra Low Power mode.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void PWR_UltraLowPowerCmd( FunctionalState NewState )
{
    /* Check the parameters */
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    *( __IO uint32_t * ) CR_ULP_BB = ( uint32_t ) NewState;
}

/**
 * @}
 */

/** @defgroup PWR_Group5 Voltage Scaling configuration functions
 *  @brief   Voltage Scaling configuration functions
 *
 * @verbatim
 * ==============================================================================
 ##### Voltage Scaling configuration functions #####
 #####==============================================================================
 #####
 #####(+) The dynamic voltage scaling is a power management technique which consists in
 #####  increasing or decreasing the voltage used for the digital peripherals (VCORE),
 #####  according to the circumstances.
 #####
 #####[..] Depending on the device voltage range, the maximum frequency and FLASH wait
 #####  state should be adapted accordingly:
 #####[..]
 +------------------------------------------------------------------+
 |   Wait states   |                HCLK clock frequency (MHz)      |
 |                 |------------------------------------------------|
 |    (Latency)    |            voltage range       | voltage range |
 |                 |            1.65 V - 3.6 V      | 2.0 V - 3.6 V |
 |                 |----------------|---------------|---------------|
 |                 |     Range 3    |    Range 2    |    Range 1    |
 |                 |  VCORE = 1.2 V | VCORE = 1.5 V | VCORE = 1.8 V |
 |---------------- |----------------|---------------|---------------|
 | 0WS(1CPU cycle) |0 < HCLK <= 2   |0 < HCLK <= 8  |0 < HCLK <= 16 |
 |-----------------|----------------|---------------|---------------|
 | 1WS(2CPU cycle) |2 < HCLK <= 4   |8 < HCLK <= 16 |16 < HCLK <= 32|
 |-----------------|----------------|---------------|---------------|
 | CPU Performance |      Low       |     Medium    |     High      |
 |-----__----------|----------------|---------------|---------------|
 |Power Performance|      High      |     Medium    |      Low      |
 +------------------------------------------------------------------+
 |
 |  (+) To modify the Product voltage range, user application has to:
 |      (++) Check VDD to identify which ranges are allowed (see table above).
 |      (++) Check the PWR_FLAG_VOSF (Voltage Scaling update ongoing) using the PWR_GetFlagStatus()
 |           function and wait until it is  reset.
 |      (++) Configure the Voltage range using the PWR_VoltageScalingConfig() function.
 |
 |  (+) When VCORE range 1 is selected and VDD drops below 2.0 V, the application must
 |      reconfigure the system:
 |      (++) Detect that VDD drops below 2.0 V using the PVD Level 1.
 |      (++) Adapt the clock frequency to the voltage range that will be selected at next step.
 |      (++) Select the required voltage range.
 |      (++) When VCORE range 2 or range 3 is selected and VDD drops below 2.0 V, no system
 |           reconfiguration is required.
 |
 |  (+) When VDD is above 2.0 V, any of the 3 voltage ranges can be selected.
 |      (++) When the voltage range is above the targeted voltage range (e.g. from range
 |           1 to 2).
 |      (++) Adapt the clock frequency to the lower voltage range that will be selected
 |           at next step.
 |      (++) Select the required voltage range.
 |      (++) When the voltage range is below the targeted voltage range (e.g. from range
 |           3 to 1).
 |      (++) Select the required voltage range.
 |      (++) Tune the clock frequency if needed.
 |
 |  (+) When VDD is below 2.0 V, only range 2 and 3 can be selected:
 |      (++) From range 2 to range 3.
 |           (+++) Adapt the clock frequency to voltage range 3.
 |           (+++) Select voltage range 3.
 |      (++) From range 3 to range 2.
 |           (+++) Select the voltage range 2.
 |           (+++) Tune the clock frequency if needed.
 |
 | @endverbatim
 * @{
 */

/**
 * @brief  Configures the voltage scaling range.
 * @note   During voltage scaling configuration, the system clock is stopped
 *         until the regulator is stabilized (VOSF = 0). This must be taken
 *         into account during application developement, in case a critical
 *         reaction time to interrupt is needed, and depending on peripheral
 *         used (timer, communication,...).
 *
 * @param  PWR_VoltageScaling: specifies the voltage scaling range.
 *   This parameter can be:
 *     @arg PWR_VoltageScaling_Range1: Voltage Scaling Range 1 (VCORE = 1.8V).
 *     @arg PWR_VoltageScaling_Range2: Voltage Scaling Range 2 (VCORE = 1.5V).
 *     @arg PWR_VoltageScaling_Range3: Voltage Scaling Range 3 (VCORE = 1.2V)
 * @retval None
 */
void PWR_VoltageScalingConfig( uint32_t PWR_VoltageScaling )
{
    uint32_t tmp = 0;

    /* Check the parameters */
    assert_param( IS_PWR_VOLTAGE_SCALING_RANGE( PWR_VoltageScaling ) );

    tmp = PWR->CR;

    tmp &= CR_VOS_MASK;
    tmp |= PWR_VoltageScaling;

