FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_pwr.c
    PWR->CR = tmp & 0xFFFFFFF3;
}

/**
 * @}
 */

/** @defgroup PWR_Group6 Low Power modes configuration functions
 *  @brief   Low Power modes configuration functions
 *
 * @verbatim
 * ==============================================================================
 ##### Low Power modes configuration functions #####
 #####==============================================================================
 #####
 #####[..] The devices feature five low-power modes:
 #####(+) Low power run mode: regulator in low power mode, limited clock frequency,
 #####  limited number of peripherals running.
 #####(+) Sleep mode: Cortex-M3 core stopped, peripherals kept running.
 #####(+) Low power sleep mode: Cortex-M3 core stopped, limited clock frequency,
 #####  limited number of peripherals running, regulator in low power mode.
 #####(+) Stop mode: all clocks are stopped, regulator running, regulator in low power mode.
 #####(+) Standby mode: VCORE domain powered off.
 #####
 *** Low power run mode (LP run) ***
 ***===================================
 ***  [..]
 ***(+) Entry:
 ***    (++) Decrease the system frequency.
 ***    (++) The regulator is forced in low power mode using the PWR_EnterLowPowerRunMode()
 ***         function.
 ***(+) Exit:
 ***    (++) The regulator is forced in Main regulator mode sing the PWR_EnterLowPowerRunMode()
 ***         function.
 ***    (++) Increase the system frequency if needed.
 ***
 *** Sleep mode ***
 ***==================
 ***[..]
 ***(+) Entry:
 ***    (++) The Sleep mode is entered by using the PWR_EnterSleepMode(PWR_Regulator_ON,)
 ***         function with regulator ON.
 ***(+) Exit:
 ***    (++) Any peripheral interrupt acknowledged by the nested vectored interrupt
 ***         controller (NVIC) can wake up the device from Sleep mode.
 ***
 *** Low power sleep mode (LP sleep) ***
 ***=======================================
 ***[..]
 ***(+) Entry:
 ***    (++) The Flash memory must be switched off by using the FLASH_SLEEPPowerDownCmd()
 ***         function.
 ***    (++) Decrease the system frequency.
 ***    (++) The regulator is forced in low power mode and the WFI or WFE instructions
 ***         are executed using the PWR_EnterSleepMode(PWR_Regulator_LowPower,) function
 ***         with regulator in LowPower.
 ***(+) Exit:
 ***    (++) Any peripheral interrupt acknowledged by the nested vectored interrupt
 ***         controller (NVIC) can wake up the device from Sleep LP mode.
 ***
 *** Stop mode ***
 ***=================
 ***[..] In Stop mode, all clocks in the VCORE domain are stopped, the PLL, the MSI,
 ***   the HSI and the HSE RC oscillators are disabled. Internal SRAM and register
 ***   contents are preserved.
 ***   The voltage regulator can be configured either in normal or low-power mode.
 ***   To minimize the consumption In Stop mode, VREFINT, the BOR, PVD, and temperature
 ***   sensor can be switched off before entering the Stop mode. They can be switched
 ***   on again by software after exiting the Stop mode using the PWR_UltraLowPowerCmd()
 ***   function.
 ***
 ***(+) Entry:
 ***    (++) The Stop mode is entered using the PWR_EnterSTOPMode(PWR_Regulator_LowPower,)
 ***         function with regulator in LowPower or with Regulator ON.
 ***(+) Exit:
 ***    (++) Any EXTI Line (Internal or External) configured in Interrupt/Event mode.
 ***
 *** Standby mode ***
 ***====================
 ***[..] The Standby mode allows to achieve the lowest power consumption. It is based
 ***   on the Cortex-M3 deepsleep mode, with the voltage regulator disabled.
 ***   The VCORE domain is consequently powered off. The PLL, the MSI, the HSI
 ***   oscillator and the HSE oscillator are also switched off. SRAM and register
 ***   contents are lost except for the RTC registers, RTC backup registers and
 ***   Standby circuitry.
 ***
 ***[..] The voltage regulator is OFF.
 ***
 ***[..] To minimize the consumption In Standby mode, VREFINT, the BOR, PVD, and temperature
 ***   sensor can be switched off before entering the Standby mode. They can be switched
 ***   on again by software after exiting the Standby mode using the PWR_UltraLowPowerCmd()
 ***   function.
 ***
 ***(+) Entry:
 ***    (++) The Standby mode is entered using the PWR_EnterSTANDBYMode() function.
 ***(+) Exit:
 ***    (++) WKUP pin rising edge, RTC alarm (Alarm A and Alarm B), RTC wakeup,
 ***        tamper event, time-stamp event, external reset in NRST pin, IWDG reset.
 ***
 *** Auto-wakeup (AWU) from low-power mode ***
 ***=============================================
 ***[..]The MCU can be woken up from low-power mode by an RTC Alarm event, an RTC
 ***  Wakeup event, a tamper event, a time-stamp event, or a comparator event,
 ***  without depending on an external interrupt (Auto-wakeup mode).
 ***
 ***(+) RTC auto-wakeup (AWU) from the Stop mode
 ***    (++) To wake up from the Stop mode with an RTC alarm event, it is necessary to:
 ***         (+++) Configure the EXTI Line 17 to be sensitive to rising edges (Interrupt
 ***               or Event modes) using the EXTI_Init() function.
 ***         (+++) Enable the RTC Alarm Interrupt using the RTC_ITConfig() function
 ***         (+++) Configure the RTC to generate the RTC alarm using the RTC_SetAlarm()
 ***               and RTC_AlarmCmd() functions.
 ***    (++) To wake up from the Stop mode with an RTC Tamper or time stamp event, it
 ***         is necessary to:
 ***         (+++) Configure the EXTI Line 19 to be sensitive to rising edges (Interrupt
 ***               or Event modes) using the EXTI_Init() function.
 ***         (+++) Enable the RTC Tamper or time stamp Interrupt using the RTC_ITConfig()
 ***               function.
 ***         (+++) Configure the RTC to detect the tamper or time stamp event using the
 ***               RTC_TimeStampConfig(), RTC_TamperTriggerConfig() and RTC_TamperCmd()
 ***               functions.
 ***    (++) To wake up from the Stop mode with an RTC WakeUp event, it is necessary to:
 ***         (+++) Configure the EXTI Line 20 to be sensitive to rising edges (Interrupt
 ***               or Event modes) using the EXTI_Init() function.
 ***         (+++) Enable the RTC WakeUp Interrupt using the RTC_ITConfig() function.
 ***         (+++) Configure the RTC to generate the RTC WakeUp event using the RTC_WakeUpClockConfig(),
 ***               RTC_SetWakeUpCounter() and RTC_WakeUpCmd() functions.
 ***
 ***(+) RTC auto-wakeup (AWU) from the Standby mode
 ***    (++) To wake up from the Standby mode with an RTC alarm event, it is necessary to:
 ***         (+++) Enable the RTC Alarm Interrupt using the RTC_ITConfig() function.
 ***         (+++) Configure the RTC to generate the RTC alarm using the RTC_SetAlarm()
 ***               and RTC_AlarmCmd() functions.
 ***    (++) To wake up from the Standby mode with an RTC Tamper or time stamp event, it
 ***         is necessary to:
 ***         (+++) Enable the RTC Tamper or time stamp Interrupt using the RTC_ITConfig()
 ***               function.
 ***         (+++) Configure the RTC to detect the tamper or time stamp event using the
 ***               RTC_TimeStampConfig(), RTC_TamperTriggerConfig() and RTC_TamperCmd()
 ***               functions.
 ***    (++) To wake up from the Standby mode with an RTC WakeUp event, it is necessary to:
 ***         (+++) Enable the RTC WakeUp Interrupt using the RTC_ITConfig() function
 ***         (+++) Configure the RTC to generate the RTC WakeUp event using the RTC_WakeUpClockConfig(),
 ***               RTC_SetWakeUpCounter() and RTC_WakeUpCmd() functions.
 ***
 ***(+) Comparator auto-wakeup (AWU) from the Stop mode
 ***    (++) To wake up from the Stop mode with an comparator 1 or comparator 2 wakeup
 ***         event, it is necessary to:
 ***         (+++) Configure the EXTI Line 21 for comparator 1 or EXTI Line 22 for comparator 2
 ***               to be sensitive to to the selected edges (falling, rising or falling
 ***               and rising) (Interrupt or Event modes) using the EXTI_Init() function.
 ***         (+++) Configure the comparator to generate the event.
 ***
 ***@endverbatim
 * @{
 */

/**
 * @brief  Enters/Exits the Low Power Run mode.
 * @note   Low power run mode can only be entered when VCORE is in range 2.
 *         In addition, the dynamic voltage scaling must not be used when Low
 *         power run mode is selected. Only Stop and Sleep modes with regulator
 *         configured in Low power mode is allowed when Low power run mode is
 *         selected.
 * @note   In Low power run mode, all I/O pins keep the same state as in Run mode.
 * @param  NewState: new state of the Low Power Run mode.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void PWR_EnterLowPowerRunMode( FunctionalState NewState )
{
    /* Check the parameters */
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    if( NewState != DISABLE )
    {
        PWR->CR |= PWR_CR_LPSDSR;
        PWR->CR |= PWR_CR_LPRUN;
    }
    else
    {
        PWR->CR &= ( uint32_t ) ~( ( uint32_t ) PWR_CR_LPRUN );
        PWR->CR &= ( uint32_t ) ~( ( uint32_t ) PWR_CR_LPSDSR );
    }
}

/**
 * @brief  Enters Sleep mode.
 * @note   In Sleep mode, all I/O pins keep the same state as in Run mode.
 * @param  PWR_Regulator: specifies the regulator state in Sleep mode.
 *   This parameter can be one of the following values:
 *     @arg PWR_Regulator_ON: Sleep mode with regulator ON
 *     @arg PWR_Regulator_LowPower: Sleep mode with regulator in low power mode
 * @note   Low power sleep mode can only be entered when VCORE is in range 2.
 * @note   When the voltage regulator operates in low power mode, an additional
 *         startup delay is incurred when waking up from Low power sleep mode.
 * @param  PWR_SLEEPEntry: specifies if SLEEP mode in entered with WFI or WFE instruction.
 *   This parameter can be one of the following values:
 *     @arg PWR_SLEEPEntry_WFI: enter SLEEP mode with WFI instruction
 *     @arg PWR_SLEEPEntry_WFE: enter SLEEP mode with WFE instruction
 * @retval None
 */
void PWR_EnterSleepMode( uint32_t PWR_Regulator,
                         uint8_t PWR_SLEEPEntry )
{
    uint32_t tmpreg = 0;

    /* Check the parameters */
    assert_param( IS_PWR_REGULATOR( PWR_Regulator ) );

    assert_param( IS_PWR_SLEEP_ENTRY( PWR_SLEEPEntry ) );

    /* Select the regulator state in Sleep mode ---------------------------------*/
    tmpreg = PWR->CR;

    /* Clear PDDS and LPDSR bits */
    tmpreg &= CR_DS_MASK;

    /* Set LPDSR bit according to PWR_Regulator value */
    tmpreg |= PWR_Regulator;

