FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_pwr.c
    /* Store the new value */
    PWR->CR = tmpreg;

    /* Clear SLEEPDEEP bit of Cortex System Control Register */
    SCB->SCR &= ( uint32_t ) ~( ( uint32_t ) SCB_SCR_SLEEPDEEP );

    /* Select SLEEP mode entry -------------------------------------------------*/
    if( PWR_SLEEPEntry == PWR_SLEEPEntry_WFI )
    {
        /* Request Wait For Interrupt */
        __WFI();
    }
    else
    {
        /* Request Wait For Event */
        __WFE();
    }
}

/**
 * @brief  Enters STOP mode.
 * @note   In Stop mode, all I/O pins keep the same state as in Run mode.
 * @note   When exiting Stop mode by issuing an interrupt or a wakeup event,
 *         the MSI RC oscillator is selected as system clock.
 * @note   When the voltage regulator operates in low power mode, an additional
 *         startup delay is incurred when waking up from Stop mode.
 *         By keeping the internal regulator ON during Stop mode, the consumption
 *         is higher although the startup time is reduced.
 * @param  PWR_Regulator: specifies the regulator state in STOP mode.
 *   This parameter can be one of the following values:
 *     @arg PWR_Regulator_ON: STOP mode with regulator ON.
 *     @arg PWR_Regulator_LowPower: STOP mode with regulator in low power mode.
 * @param  PWR_STOPEntry: specifies if STOP mode in entered with WFI or WFE instruction.
 *   This parameter can be one of the following values:
 *     @arg PWR_STOPEntry_WFI: enter STOP mode with WFI instruction.
 *     @arg PWR_STOPEntry_WFE: enter STOP mode with WFE instruction.
 * @retval None
 */
void PWR_EnterSTOPMode( uint32_t PWR_Regulator,
                        uint8_t PWR_STOPEntry )
{
    uint32_t tmpreg = 0;

    /* Check the parameters */
    assert_param( IS_PWR_REGULATOR( PWR_Regulator ) );
    assert_param( IS_PWR_STOP_ENTRY( PWR_STOPEntry ) );

    /* Select the regulator state in STOP mode ---------------------------------*/
    tmpreg = PWR->CR;
    /* Clear PDDS and LPDSR bits */
    tmpreg &= CR_DS_MASK;

    /* Set LPDSR bit according to PWR_Regulator value */
    tmpreg |= PWR_Regulator;

    /* Store the new value */
    PWR->CR = tmpreg;

    /* Set SLEEPDEEP bit of Cortex System Control Register */
    SCB->SCR |= SCB_SCR_SLEEPDEEP;

    /* Select STOP mode entry --------------------------------------------------*/
    if( PWR_STOPEntry == PWR_STOPEntry_WFI )
    {
        /* Request Wait For Interrupt */
        __WFI();
    }
    else
    {
        /* Request Wait For Event */
        __WFE();
    }

    /* Reset SLEEPDEEP bit of Cortex System Control Register */
    SCB->SCR &= ( uint32_t ) ~( ( uint32_t ) SCB_SCR_SLEEPDEEP );
}

/**
 * @brief  Enters STANDBY mode.
 * @note   In Standby mode, all I/O pins are high impedance except for:
 *         Reset pad (still available)
 *         RTC_AF1 pin (PC13) if configured for Wakeup pin 2 (WKUP2), tamper,
 *         time-stamp, RTC Alarm out, or RTC clock calibration out.
 *         WKUP pin 1 (PA0) and WKUP pin 3 (PE6), if enabled.
 * @param  None
 * @retval None
 */
void PWR_EnterSTANDBYMode( void )
{
    /* Clear Wakeup flag */
    PWR->CR |= PWR_CR_CWUF;

    /* Select STANDBY mode */
    PWR->CR |= PWR_CR_PDDS;

    /* Set SLEEPDEEP bit of Cortex System Control Register */
    SCB->SCR |= SCB_SCR_SLEEPDEEP;

/* This option is used to ensure that store operations are completed */
    #if defined( __CC_ARM )
        __force_stores();
    #endif
    /* Request Wait For Interrupt */
    __WFI();
}

/**
 * @}
 */

/** @defgroup PWR_Group7 Flags management functions
 *  @brief   Flags management functions
 *
 * @verbatim
 * ==============================================================================
 ##### Flags management functions #####
 #####==============================================================================
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Checks whether the specified PWR flag is set or not.
 * @param  PWR_FLAG: specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg PWR_FLAG_WU: Wake Up flag. This flag indicates that a wakeup event
 *       was received from the WKUP pin or from the RTC alarm (Alarm A or Alarm B),
 *       RTC Tamper event, RTC TimeStamp event or RTC Wakeup.
 *     @arg PWR_FLAG_SB: StandBy flag. This flag indicates that the system was
 *                       resumed from StandBy mode.
 *     @arg PWR_FLAG_PVDO: PVD Output. This flag is valid only if PVD is enabled
 *       by the PWR_PVDCmd() function.
 *     @arg PWR_FLAG_VREFINTRDY: Internal Voltage Reference Ready flag. This
 *       flag indicates the state of the internal voltage reference, VREFINT.
 *     @arg PWR_FLAG_VOS: Voltage Scaling select flag. A delay is required for
 *       the internal regulator to be ready after the voltage range is changed.
 *       The VOSF flag indicates that the regulator has reached the voltage level
 *       defined with bits VOS[1:0] of PWR_CR register.
 *     @arg PWR_FLAG_REGLP: Regulator LP flag. This flag is set by hardware
 *       when the MCU is in Low power run mode.
 *       When the MCU exits from Low power run mode, this flag stays SET until
 *       the regulator is ready in main mode. A polling on this flag is
 *       recommended to wait for the regulator main mode.
 *       This flag is RESET by hardware when the regulator is ready.
 * @retval The new state of PWR_FLAG (SET or RESET).
 */
FlagStatus PWR_GetFlagStatus( uint32_t PWR_FLAG )
{
    FlagStatus bitstatus = RESET;

    /* Check the parameters */
    assert_param( IS_PWR_GET_FLAG( PWR_FLAG ) );

    if( ( PWR->CSR & PWR_FLAG ) != ( uint32_t ) RESET )
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    /* Return the flag status */
    return bitstatus;
}

/**
 * @brief  Clears the PWR's pending flags.
 * @param  PWR_FLAG: specifies the flag to clear.
 *   This parameter can be one of the following values:
 *     @arg PWR_FLAG_WU: Wake Up flag
 *     @arg PWR_FLAG_SB: StandBy flag
 * @retval None
 */
void PWR_ClearFlag( uint32_t PWR_FLAG )
{
    /* Check the parameters */
    assert_param( IS_PWR_CLEAR_FLAG( PWR_FLAG ) );

    PWR->CR |= PWR_FLAG << 2;
}

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
